---
type: StructuralSectionStructuralTees
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 4
tags: [revit-api, class]
---

# StructuralSectionStructuralTees

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionStructuralTees | 2015 | `public StructuralSectionStructuralTees ( double width , double height , double flangeThickness , double flangeThicknessLocation , double webThickness , double webThicknessLocation , double webFillet , double flangeFillet` |
| Property | BoltDiameter | 2015 | `public double BoltDiameter { get ; set ; }` |
| Property | BoltSpacing | 2015 | `public double BoltSpacing { get ; set ; }` |
| Property | BoltSpacingWeb | 2015 | `public double BoltSpacingWeb { get ; set ; }` |